#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-prod-sso-requests/runs/run-4BSVyxr1MpFpHdbj

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Initializing plugins and modules...
random_password.db_password: Refreshing state... [id=none]
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=7pXWFg]
module.s3_ocp.aws_s3_bucket.this: Refreshing state... [id=xgr00q-prod-ocp]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=kgodz1zmk2]
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:ca-central-1:751704728437:certificate/842691e5-ab99-440d-8818-d4b9e623eec3]
module.s3_keycloak_v2.aws_s3_bucket.this: Refreshing state... [id=xgr00q-prod-keycloak]
aws_iam_role.api_gateway_s3_role: Refreshing state... [id=ApiGatewayAmazonS3AccessRole]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.s3_sysdig.aws_s3_bucket.this: Refreshing state... [id=xgr00q-prod-sysdig]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=tf-apply-scheduler]
module.s3_sso_api_swagger.aws_s3_bucket.this: Refreshing state... [id=xgr00q-prod-api-swagger]
aws_api_gateway_resource.api: Refreshing state... [id=l8vstw]
aws_api_gateway_resource.openapi_swagger: Refreshing state... [id=smd25o]
aws_api_gateway_resource.actions: Refreshing state... [id=vw6kd8]
aws_api_gateway_resource.app: Refreshing state... [id=sniyra]
aws_api_gateway_resource.api_proxy: Refreshing state... [id=5k4vgg]
aws_security_group.rds_sg: Refreshing state... [id=sg-0cbc5116a7eb44966]
aws_api_gateway_resource.openapi_swagger_proxy: Refreshing state... [id=8c4eij]
aws_api_gateway_resource.swagger_assets_proxy: Refreshing state... [id=fxl742]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-006d5ccf7acdb99cc]
aws_api_gateway_resource.actions_proxy: Refreshing state... [id=cn65f5]
aws_apigatewayv2_domain_name.this: Refreshing state... [id=api.loginproxy.gov.bc.ca]
aws_api_gateway_resource.proxy: Refreshing state... [id=aqhevc]
aws_api_gateway_method.api_proxy: Refreshing state... [id=agm-kgodz1zmk2-5k4vgg-ANY]
aws_api_gateway_method.swagger_assets_proxy: Refreshing state... [id=agm-kgodz1zmk2-fxl742-GET]
aws_api_gateway_method.openapi_swagger_proxy: Refreshing state... [id=agm-kgodz1zmk2-8c4eij-GET]
module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-prod-keycloak]
module.s3_ocp.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-prod-ocp]
module.s3_ocp.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-prod-ocp]
module.s3_ocp.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-prod-ocp]
module.s3_ocp.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-prod-ocp,private]
module.s3_keycloak_v2.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-prod-keycloak]
aws_api_gateway_method.actions_proxy: Refreshing state... [id=agm-kgodz1zmk2-cn65f5-ANY]
module.s3_keycloak_v2.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-prod-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-prod-keycloak,private]
aws_lambda_function.scheduler: Refreshing state... [id=lambda-scheduler]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-kgodz1zmk2-aqhevc-ANY]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210903190658559400000001]
module.s3_sysdig.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-prod-sysdig]
module.s3_sysdig.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-prod-sysdig,private]
module.s3_sysdig.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-prod-sysdig]
module.s3_sysdig.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-prod-sysdig]
aws_api_gateway_method_response.openapi_swagger_proxy: Refreshing state... [id=agmr-kgodz1zmk2-8c4eij-GET-200]
aws_api_gateway_method_response.swagger_assets_proxy: Refreshing state... [id=agmr-kgodz1zmk2-fxl742-GET-200]
module.s3_sso_api_swagger.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-prod-api-swagger]
aws_api_gateway_integration.openapi_swagger: Refreshing state... [id=agi-kgodz1zmk2-8c4eij-GET]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
module.s3_sso_api_swagger.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-prod-api-swagger]
module.s3_sso_api_swagger.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-prod-api-swagger,private]
aws_apigatewayv2_api_mapping.this: Refreshing state... [id=g92x81]
aws_api_gateway_integration.openapi_swagger_assets: Refreshing state... [id=agi-kgodz1zmk2-fxl742-GET]
aws_iam_role_policy.s3_read_access_policy: Refreshing state... [id=ApiGatewayAmazonS3AccessRole:AWSS3ResourceReadAccessRolePolicy]
aws_s3_object.swagger_dist["absolute-path.js"]: Refreshing state... [id=absolute-path.js]
aws_s3_object.swagger_dist["swagger-ui.css"]: Refreshing state... [id=swagger-ui.css]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js"]: Refreshing state... [id=swagger-ui-es-bundle-core.js]
aws_s3_object.swagger_dist["package.json"]: Refreshing state... [id=package.json]
aws_s3_object.swagger_dist["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
aws_s3_object.swagger_dist["swagger-initializer.js"]: Refreshing state... [id=swagger-initializer.js]
aws_s3_object.swagger_dist["swagger-ui-bundle.js.map"]: Refreshing state... [id=swagger-ui-bundle.js.map]
aws_s3_object.swagger_dist["swagger-ui.js.map"]: Refreshing state... [id=swagger-ui.js.map]
aws_s3_object.swagger_dist["swagger-ui-bundle.js"]: Refreshing state... [id=swagger-ui-bundle.js]
aws_s3_object.swagger_dist["oauth2-redirect.html"]: Refreshing state... [id=oauth2-redirect.html]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js.map"]: Refreshing state... [id=swagger-ui-es-bundle.js.map]
aws_s3_object.swagger_dist["swagger-ui.js"]: Refreshing state... [id=swagger-ui.js]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js.map"]: Refreshing state... [id=swagger-ui-standalone-preset.js.map]
aws_s3_object.swagger_dist["swagger-output.json"]: Refreshing state... [id=swagger-output.json]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js"]: Refreshing state... [id=swagger-ui-es-bundle.js]
aws_s3_object.swagger_dist["index.js"]: Refreshing state... [id=index.js]
aws_s3_object.swagger_dist["README.md"]: Refreshing state... [id=README.md]
aws_s3_object.swagger_dist["index.css"]: Refreshing state... [id=index.css]
aws_s3_object.swagger_dist["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js"]: Refreshing state... [id=swagger-ui-standalone-preset.js]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js.map"]: Refreshing state... [id=swagger-ui-es-bundle-core.js.map]
aws_s3_object.swagger_dist["swagger-ui.css.map"]: Refreshing state... [id=swagger-ui.css.map]
aws_s3_object.swagger_dist["index.html"]: Refreshing state... [id=index.html]
aws_lambda_permission.scheduler: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_api_gateway_integration_response.openapi_swagger_assets: Refreshing state... [id=agir-kgodz1zmk2-fxl742-GET-200]
aws_api_gateway_integration_response.openapi_swagger: Refreshing state... [id=agir-kgodz1zmk2-8c4eij-GET-200]
aws_cloudwatch_event_target.scheduler: Refreshing state... [id=tf-apply-scheduler-scheduler]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-3019186098]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_function.css_api: Refreshing state... [id=lambda-css-api]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_api_gateway_integration.api: Refreshing state... [id=agi-kgodz1zmk2-5k4vgg-ANY]
aws_lambda_permission.apigw_api: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-kgodz1zmk2-cn65f5-ANY]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-kgodz1zmk2-aqhevc-ANY]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_deployment.this: Refreshing state... [id=gtj2ip]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lambda_function.css_api has been changed
  ~ resource "aws_lambda_function" "css_api" {
        id                             = "lambda-css-api"
      + qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:751704728437:function:lambda-css-api:$LATEST/invocations"
        tags                           = {
            "managed-by" = "terraform"
        }
        # (26 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }
  # aws_lambda_function.actions has been changed
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      + qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:751704728437:function:lambda-actions:$LATEST/invocations"
        tags                           = {
            "managed-by" = "terraform"
        }
        # (26 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }
  # aws_lambda_function.app has been changed
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      + qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:751704728437:function:lambda-app:$LATEST/invocations"
        tags                           = {
            "managed-by" = "terraform"
        }
        # (26 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }
  # aws_lambda_function.scheduler has been changed
  ~ resource "aws_lambda_function" "scheduler" {
        id                             = "lambda-scheduler"
      + qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:751704728437:function:lambda-scheduler:$LATEST/invocations"
        tags                           = {
            "managed-by" = "terraform"
        }
        # (26 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }
  # aws_lambda_function.db has been changed
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      + qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:751704728437:function:lambda-db:$LATEST/invocations"
        tags                           = {
            "managed-by" = "terraform"
        }
        # (26 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - logs    = []
                  - success = true
                }
              - headers    = {
                  - time = "2022-09-12T22:39:37.457Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_dynamodb_table.state_locking will be created
  + resource "aws_dynamodb_table" "state_locking" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "xgr00q-prod-state-locking"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2022-09-12T22:39:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "hg0KMkOfG2iDkewriSvDa5D1S6xtyiRuXTXZGzJxXXM=" -> "2lqJfcHOW1vzwCgv7h6Zv5PnYvmbU9Gc5QnV3nnb7i8="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2022-09-12T22:39:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "E8uwiOiqiMUrpkhLU/goSBXBY+p1OlWHZ2ndPu7yzu8=" -> "hkA+R4/e7crLdn1Y+9eDfocXYpGHI/C93NzZTu0/gXg="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.css_api will be updated in-place
  ~ resource "aws_lambda_function" "css_api" {
        id                             = "lambda-css-api"
      ~ last_modified                  = "2022-09-12T22:39:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "XJZz/YtGGE2PvptTsRZEfT5QxGlzzI7OjqJb364C72I=" -> "75DCG19Eq6T2GdWRaU7sg06+4LHF0tImZhtPjsQLA4w="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2022-09-12T22:39:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "R3Uxq7N0iIB6w1p9M47eFfP5wJSd6DYypdI4RA0ycJM=" -> "uEp1EIFaEyXc0AhvlQv0Cq2c9oW7JRWlX9OurP/WvD8="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.scheduler will be updated in-place
  ~ resource "aws_lambda_function" "scheduler" {
        id                             = "lambda-scheduler"
      ~ last_modified                  = "2022-09-12T22:39:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "tt5VumLMe1e7OR/zGBVNM79VfHwQS3YMm+JoElY5AI8=" -> "cbKsVA4PbQC9ocINGwDPB1AKOD3lMGdrkJiPSp202Qo="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_s3_object.swagger_dist["swagger-output.json"] will be updated in-place
  ~ resource "aws_s3_object" "swagger_dist" {
      ~ etag               = "e121b30bc6394cd9618e97437b9c4573" -> "1698cec504243622558425235b2e17a9"
        id                 = "swagger-output.json"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 6 to change, 0 to destroy.

Changes to Outputs:
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2022-09-12T22:39:37.457Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 40 estimated
           $86.4/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*